pi: proc options(main);
   declare (step, x, s, mypi) float(18);
   declare (i, n) fixed binary;
   declare ioa_ entry options(variable);

   n = 10000;

   call ioa_ ("Calculating Pi with:");
   call ioa_ ("                       ^d slices", n);

   s = 0.0;
   step = 1.0/n;

   do i = 1 to n;
      x = (i - 0.5) * step;
      s = s + 4.0 /(1.0 + (x*x));
   end;

   mypi = s * step;

   call ioa_ ("Estimated value of Pi:  ^f",mypi);
   return;
end pi;
